Торговля_PostgreSQL.ПотоковоеСканирование/src/InformationRegisters/ПС_ОбработкаДокументов/ПС_ОбработкаДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПС_ОбработкаДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Распознан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Найден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прикреплен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИзвлеченныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеРеквизиты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбрабатывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ПС_ТипыРаспознанныхДокументов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_PostgreSQL.ПотоковоеСканирование/src/Catalogs/ПС_КаталогиПотоковогоСканирования/ПС_КаталогиПотоковогоСканирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПС_КаталогиПотоковогоСканирования</name>
  <predefined>
    <items>
      <name>КаталогДляОбработанныхДокументов</name>
      <description>Каталог для обработанных </description>
    </items>
  </predefined>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Торговля_PostgreSQL.ПотоковоеСканирование/src/CommonModules/ПС_ИндексацияФайловВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает массив каталогов
//Параметры:
// КаталогиНаКлиенте - булево
// Возвращает массив Обрабатываемых каталогов с полями:
//	ПутьНаСервере - строка
//	НаКлиенте - булево
//Возвращаемое значение:
//	Тип: массив структур
Функция ПолучитьИндексируемыеКаталоги(КаталогиНаКлиенте = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПС_КаталогиПотоковогоСканирования.Ссылка КАК Ссылка,
		|	ПС_КаталогиПотоковогоСканирования.ПутьККаталогу КАК ПутьККаталогу,
		|	ПС_КаталогиПотоковогоСканирования.НаКлиенте КАК НаКлиенте
		|ИЗ
		|	Справочник.ПС_КаталогиПотоковогоСканирования КАК ПС_КаталогиПотоковогоСканирования
		|ГДЕ
		|	ПС_КаталогиПотоковогоСканирования.Активен
		|	И
		|		ПС_КаталогиПотоковогоСканирования.Ссылка <> ЗНАЧЕНИЕ(Справочник.ПС_КаталогиПотоковогоСканирования.КаталогДляОбработанныхДокументов)
		|	И (&КаталогиНаКлиенте = НЕОПРЕДЕЛЕНО
		|	ИЛИ ПС_КаталогиПотоковогоСканирования.НаКлиенте = &КаталогиНаКлиенте)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаКлиенте";
	
	Запрос.УстановитьПараметр("КаталогиНаКлиенте", КаталогиНаКлиенте);
	
	ВыборкаКаталогов = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока ВыборкаКаталогов.Следующий() Цикл
		
		СтруктураКаталога = Новый Структура;
		СтруктураКаталога.Вставить("ПутьККаталогу", ВыборкаКаталогов.ПутьККаталогу);
		СтруктураКаталога.Вставить("НаКлиенте", ВыборкаКаталогов.НаКлиенте);
		
		Результат.Добавить(СтруктураКаталога);
		
	КонецЦикла;
	
	Возврат Результат;	
		
КонецФункции


//Перебирает файлы в каталогах сканирования и заносит в регистр
Процедура ПроверитьКаталогиСФайлами() Экспорт
	
	МассивКаталогов = ПолучитьИндексируемыеКаталоги(Ложь);
	
	Для каждого ВыборкаКаталогов Из МассивКаталогов Цикл
		
		ПутьККаталогу = ВыборкаКаталогов.ПутьККаталогу;		
		КаталогНаСервере = Новый Файл(ПутьККаталогу);
		
		Если НЕ КаталогНаСервере.Существует() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(ПутьККаталогу, "*.*", Истина);
		
		Для Каждого Файл Из МассивФайлов Цикл
			
			Если ЭтоИзображениеИлиPDF(Файл.Расширение) Тогда
	
				ХешСумма = ПолучитьХешСуммуФайла(Файл.ПолноеИмя);

				ДобавитьФайлВРегистр(Файл.ПолноеИмя, ХешСумма);

			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Добавляет файл в регистр
//Параметры:
//	ПутьКФайлу - строка
//	ХешСумма - строка
//	ФайлНаКлиенте - булево
Процедура ДобавитьФайлВРегистр(ПутьКФайлу, ХешСумма, ФайлНаКлиенте = Ложь) Экспорт

	НаборЗаписей = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ХешСумма.Установить(ХешСумма);
	НаборЗаписей.Прочитать();
				
	Если НаборЗаписей.Количество() = 0 Тогда
				
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.ХешСумма = ХешСумма;
		НоваяЗапись.ИмяФайла = ПутьКФайлу;
		НоваяЗапись.НаКлиенте = ФайлНаКлиенте;
					
		НаборЗаписей.Записать();
					
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ЭтоИзображениеИлиPDF(Расширение) Экспорт
		
	// Проверяем, является ли файл изображением или PDF файлом
	МассивДопустимыхРасширений = Новый Массив;
	МассивДопустимыхРасширений.Добавить(".jpg");
	МассивДопустимыхРасширений.Добавить(".jpeg");
	МассивДопустимыхРасширений.Добавить(".png");
	МассивДопустимыхРасширений.Добавить(".pdf");
	
	Возврат МассивДопустимыхРасширений.Найти(Расширение) <> Неопределено;
	
КонецФункции

Функция ПолучитьХешСуммуФайла(Знач ПолноеИмяФайла) Экспорт
	
	НужноУдалитьФайл = Ложь;
	
	Если ЭтоАдресВременногоХранилища(ПолноеИмяФайла) Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПолноеИмяФайла);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		ПолноеИмяФайла = ИмяВременногоФайла;
		
		НужноУдалитьФайл = Истина;
		
	КонецЕсли;
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.ДобавитьФайл(ПолноеИмяФайла);
	ХешСумма = Строка(Хеш.ХешСумма);
	
	Если НужноУдалитьФайл Тогда
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЕсли;
	
	Возврат ХешСумма;
	
КонецФункции

#КонецОбласти
